{
    "blockone": [
        {
            "title": "Holy Frog",
            "thumbnail": "../img/HolyFrog.png",
            "altText": "Image of the game Holy Frog with a frog character looking forward to a level of enemies",
            "description": "Developed in Unity 6, this solo project is a 2D platformer where you control a frog that can jump and shoot. The game features a variety of enemies and obstacles, with the goal of reaching the end of each level as fast as possible. The frog can use its tongue as a rope to swing across gaps. The game includes a timer to track completion time, as well as full controller support for most devices. PC only with an expirimental mobile build.",
            "itchio": "soon",
            "github": "https://github.com/DMClone/Holy-Frog",
            "extendedDescriptions": [
                "With a heavy focus on physics and controls, making the game feel comfortable and responsive was my main priority. Getting it to work within seconds on controller felt great and actually better than keyboard and mouse.",
                "Blablabla"
            ],
            "images": [
                "../img/HolyFrog.png"
            ]
        },
        {
            "title": "Just Four Minutes",
            "thumbnail": "../img/JFM.png",
            "altText": "Image of a 2d game where the player is shooting enemies",
            "description": "Made in Unity 5, this rogue-lite prototype experiments with a lot of new tech, such as a new input system, dynamic controller rumble and animation controllers/clips. Made in early 2025 for PC only with controller support.",
            "itchio": "",
            "github": "https://github.com/DMClone/Rogue-ish",
            "extendedDescriptions": [
                "This snippet shows the controller rumble ienumerator being called. When it is called multiple times, it overrides the previous rumble settings and applies them instead. If the duration parameter runs out of time, it resets both frequencies (sides) to 0, assuming no other call interrupts. Before the ienumerator is called, it checks whether the last input was from a gamepad (controller) or something else. If it is a controller, it will call the ienumerator, thus saving on performance."
            ],
            "images": []
        },
        {
            "title": "Mage With Rage",
            "thumbnail": "../img/MWR.png",
            "altText": "Alt text",
            "description": "Made in Unity 6 with Finnish students during a special program, this third person beat-em-up has cool interactions with other parts of the game: like letting the player launch slimes with a swing attack, and the slime used as a projectile to activate locks! Made in May/June 2025 for PC only.",
            "itchio": "https://nielscraft12.itch.io/mage-with-rage",
            "github": "https://github.com/NielsCraft12/MageWIthRage",
            "extendedDescriptions": [
                "This snippet shows the switching in modes the slime can be in. (De)activating certain properties and components while activating new ones. While in its ragdoll state, each fixedupdate it moves slow enough, a counter will go up until it reaches a high enough amount to switch it back."
            ],
            "images": []
        },
        {
            "title": "The Forgotten Area",
            "thumbnail": "../img/TFA.png",
            "altText": "Alt text",
            "description": "Made in Unity 5, TFA is a 2D horror top down shooter with enemies that have different attacks, AI and other movement. Made in june of 2024 for PC only.",
            "itchio": "https://dmclone.itch.io/the-forgotten-area",
            "github": "https://github.com/GLU-Gaming/twinstick-2024-team-09-red-apple",
            "extendedDescriptions": [
                "This snippet shows the switching in modes the slime can be in. (De)activating certain properties and components while activating new ones. While in its ragdoll state, each fixedupdate it moves slow enough, a counter will go up until it reaches a high enough amount to switch it back."
            ],
            "images": []
        },
        {
            "title": "Charge Forward",
            "thumbnail": "../img/CF.png",
            "altText": "Alt text",
            "description": "Made in Unity 5, Charge Forward is a top down shoot-em-up where you control a tank with bouncing bullets used to shoot cacti to score points. Made in April of 2024 for PC only.",
            "itchio": "https://dmclone.itch.io/charge-forward",
            "github": "https://github.com/GLU-Gaming/shmup-2024-team-7-zefeneleaven",
            "extendedDescriptions": [
                "Fill"
            ],
            "images": []
        }
    ],
    "blocktwo": [],
    "blockthree": [
        {
            "title": "Portfolio Website",
            "thumbnail": "../img/Self.jpg",
            "altText": "Image of the DMClone website homepage",
            "description": "This very website! Made with HTML, CSS, JavaScript and Bootstrap. The site is fully responsive and works on all devices. It features a dark mode toggle, a project showcase, and an about me section. The site is hosted on GitHub Pages and the code is available on GitHub.",
            "itchio": "",
            "github": "https://github.com/DMClone/dmclone.github.io",
            "extendedDescriptions": [
                "This website was made to showcase my projects and skills as a game developer. I wanted to create a clean and modern design that is easy to navigate. I used Bootstrap to make the site responsive and ensure it looks good on all devices. I could've used google sites but I wanted full control over it in case the hosting service goes down so I can locally host it if needed.",
                "I also wanted to flex my web dev skills even if I will likely not be doing anything like this in the future. This site is build from scratch without using any templates."
            ],
            "images": []
        }
    ]
}