{
    "blockone": [
        {
            "title": "Holy Frog",
            "thumbnail": "../img/HolyFrog.png",
            "altText": "Image of the game Holy Frog with a frog character looking forward to a level of enemies",
            "description": "Developed in Unity 6, this solo project is a 2D platformer where you control a frog that can jump and shoot. The game features a variety of enemies and obstacles, with the goal of reaching the end of each level as fast as possible. The frog can use its tongue as a rope to swing across gaps. The game includes a timer to track completion time, as well as full controller support for most devices. PC only with an expirimental mobile build.",
            "itchio": "soon",
            "github": "https://github.com/DMClone/Holy-Frog",
            "extendedDescriptions": [
                "With a heavy focus on physics and controls, making the game feel comfortable and responsive was my main priority. Getting it to work within seconds on controller felt great and actually better than keyboard and mouse.",
                "Movement is slippery yet controllable, allowing for quick turns and jumps. You can store momentum by jumping right after landing, which allows for higher skill expression.",
                "The enemies are meant to be navigated around differently, requiring you to use different techniques to get past them. Sometimes enemies are grouped together so you have to reconsider going near them or looking for a different route."
            ],
            "images": [
                "../img/HolyFrog.png"
            ]
        },
        {
            "title": "Just Four Minutes",
            "thumbnail": "../img/JFM.png",
            "altText": "Image of a 2d game where the player is shooting enemies",
            "description": "Made in Unity 5, this rogue-lite prototype experiments with a lot of new tech, such as a new input system, dynamic controller rumble and animation controllers/clips. Made in early 2025 for PC only with controller support.",
            "itchio": "",
            "github": "https://github.com/DMClone/Rogue-ish",
            "extendedDescriptions": [
                "Game feel is a big focus here, wanting to make the player feel cool and powerful. Controller rumble and screenshake are tuned to give feedback without being too overwhelming.",
                "Item switching is nice and quick, using different methods on keyboard and controller with neither suffering any downsides."
            ],
            "images": [
                "../img/JFM.png"
            ]
        },
        {
            "title": "Mage With Rage",
            "thumbnail": "../img/MWR.png",
            "altText": "Alt text",
            "description": "Made in Unity 6 with Finnish students during a special program, this third person beat-em-up has cool interactions with other parts of the game: like letting the player launch slimes with a swing attack, and the slime used as a projectile to activate locks! Made in May/June 2025 for PC only.",
            "itchio": "https://nielscraft12.itch.io/mage-with-rage",
            "github": "https://github.com/NielsCraft12/MageWIthRage",
            "extendedDescriptions": [
                "The slime I programmed is very bouncy and fun to play with, featuring a ragdoll-like state when it gets hit. It can be launched around and would have been used to solve puzzles and defeat other enemies like a bowling ball.",
                "The ghost has a fun throwing mechanic where the head will always properly connect back to the body when thrown. It also adjusts the throw velocity based of how far the player is from the ghost, making it easier to hit targets that are further away."
            ],
            "images": [
                "../img/MWR.png"
            ]
        },
        {
            "title": "The Forgotten Area",
            "thumbnail": "../img/TFA.png",
            "altText": "Alt text",
            "description": "Made in Unity 5, TFA is a 2D horror top down shooter with enemies that have different attacks, AI and other movement. Made in june of 2024 for PC only.",
            "itchio": "https://dmclone.itch.io/the-forgotten-area",
            "github": "https://github.com/GLU-Gaming/twinstick-2024-team-09-red-apple",
            "extendedDescriptions": [
                "The enemies I made are designed with performance in mind, only enabled when within the player's line of sight. They also have different attack patterns and behaviors, making them more interesting to fight against."
            ],
            "images": [
                "../img/TFA.png"
            ]
        },
        {
            "title": "Charge Forward",
            "thumbnail": "../img/CF.png",
            "altText": "Alt text",
            "description": "Made in Unity 5, Charge Forward is a top down shoot-em-up where you control a tank with bouncing bullets used to shoot cacti to score points. Made in April of 2024 for PC only.",
            "itchio": "https://dmclone.itch.io/charge-forward",
            "github": "https://github.com/GLU-Gaming/shmup-2024-team-7-zefeneleaven",
            "extendedDescriptions": [
                "Fill"
            ],
            "images": [
                "../img/CF.png"
            ]
        }
    ],
    "blocktwo": [
        {
            "title": "Higher or Lower",
            "thumbnail": "../img/HL.png",
            "altText": "Image of a card game where the player has to guess whether the next number is higher or lower than the current one",
            "description": "Made in html, css and javascript, this simple game has the player guess whether the next number is higher or lower than the current one. This was the very first group project I've ever done regarding coding in general. Made in early 2023 for web browsers.",
            "gameLink": "https://dmclone.github.io/HogerLager",
            "github": "https://github.com/DMClone/HogerLager"
        },
        {
            "title": "Cookie Clicker",
            "thumbnail": "../img/CK.png",
            "altText": "Image of a cookie clicker game where the player has to click a cookie to earn points",
            "description": "Made in html, css and javascript, this simple game has the player click a cookie to earn points. The points can be used to buy upgrades that increase the points earned per click. This was kind of a test as to how I can optimize performance and do accurate calculations while also trying out new ways to make containers and responsive designs. Made in early 2023 for web browsers.",
            "gameLink": "https://dmclone.github.io/CookieClicker",
            "github": "https://github.com/DMClone/CookieClicker"
        },
        {
            "title": "Escape Room",
            "thumbnail": "../img/ER.png",
            "altText": "Image of an escape room game where the player has to solve puzzles to escape",
            "description": "Made in html, css and javascript, this simple game has the player solve puzzles to escape a room. This wasn't really that successful, but it allowed me to discover and try out some obscure HTML methods which ended up being quite fun. Made in mid 2023 for web browsers.",
            "gameLink": "",
            "github": "https://github.com/DMClone/EscapeRoom"
        }
    ],
    "blockthree": [
        {
            "title": "Portfolio Website",
            "thumbnail": "../img/Self.jpg",
            "altText": "Image of the DMClone website homepage",
            "description": "This very website! Made with HTML, CSS, JavaScript and Bootstrap. The site is fully responsive and works on all devices. It features a dark mode toggle, a project showcase, and an about me section. The site is hosted on GitHub Pages and the code is available on GitHub.",
            "itchio": "",
            "github": "https://github.com/DMClone/dmclone.github.io",
            "extendedDescriptions": [
                "This website was made to showcase my projects and skills as a game developer. I wanted to create a clean and modern design that is easy to navigate. I used Bootstrap to make the site responsive and ensure it looks good on all devices. I could've used google sites but I wanted full control over it in case the hosting service goes down so I can locally host it if needed.",
                "I also wanted to flex my web dev skills even if I will likely not be doing anything like this in the future. This site is build from scratch without using any templates."
            ],
            "images": []
        }
    ]
}